# Assignments: Prepping for Modeling

## 1. Create a Single Table

Hi there,

We just finished collecting our Q2 book sales data. Can you help us create one giant table that includes:

* April, May and June’s book sales
* Customer data

Each table has a field called customer_id that links all the tables together.

I’ve attached four files.

Thanks!\
Brooke

In [420]:
import pandas as pd

In [421]:
# Read all four files into a Jupyter Notebook
df_april = pd.read_excel('../Data/Book_Sales_April.xlsx')
df_april.info()
df_may = pd.read_excel('../Data/Book_Sales_May.xlsx')
df_may.info()
df_june = pd.read_excel('../Data/Book_Sales_June.xlsx')
df_june.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Purchase ID        13 non-null     int64
 1   Customer ID        13 non-null     int64
 2   Book               13 non-null     object
 3   Audience           13 non-null     object
 4   Genre              13 non-null     object
 5   Price              13 non-null     float64
 6   Book Rating        13 non-null     float64
 7   Purchase Location  13 non-null     object
 8   Purchase Date      13 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 1.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Purchase ID        18 non-null     int64
 1   Customer ID        18 non-null     int64
 2   Book               18 non-null     object
 3   Audience           18 non-null     object
 4   Genre              18 non-null     object
 5   Price              18 non-null     float64
 6   Book Rating        18 non-null     float64
 7   Purchase Location  18 non-null     object
 8   Purchase Date      18 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 1.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Purchase ID        19 non-null     int64
 1   Customer ID        19 non-null     int64
 2   Book               19 non-null     object
 3   Audience           19 non-null     object
 4   Genre              19 non-null     object
 5   Price              19 non-null     float64
 6   Book Rating        19 non-null     float64
 7   Purchase Location  19 non-null     object
 8   Purchase Date      19 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 1.5+ KB

In [422]:
# Concatenate the April, May and June book sales DataFrames
df_books = pd.concat([df_april, df_may, df_june]).reset_index(drop=True)
df_books.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01
1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01
2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02
3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02
4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02

In [423]:
df_cust = pd.read_csv('../Data/Book_Customers.csv')
df_cust.info()
df_cust.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Customer ID               28 non-null     int64
 1   Customer Name             28 non-null     object
 2   Age                       28 non-null     int64
 3   Has School Aged Children  28 non-null     object
 4   Has_Pets                  28 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.2+ KB

   Customer ID Customer Name  Age Has School Aged Children Has_Pets
0          101     Alexander   36                      Yes       No
1          102         Mason   16                       No       No
2          103         Ethan   55                       No       No
3          104        Daniel   70                       No       No
4          105       Michael   18                       No      Yes

In [424]:
# Join the newly created book sales DataFrame with the customers DataFrame on customer_id
# Which type of join do you think would work best here?
df_merged = df_books.merge(df_cust, on='Customer ID', how='left')

In [425]:
df_merged.reset_index(drop=True, inplace=True)
df_merged.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02,Mason,16,No,No
3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02,Mason,16,No,No
4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02,Mason,16,No,No

In [426]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Purchase ID               50 non-null     int64
 1   Customer ID               50 non-null     int64
 2   Book                      50 non-null     object
 3   Audience                  50 non-null     object
 4   Genre                     50 non-null     object
 5   Price                     50 non-null     float64
 6   Book Rating               50 non-null     float64
 7   Purchase Location         50 non-null     object
 8   Purchase Date             50 non-null     datetime64[ns]
 9   Customer Name             50 non-null     object
 10  Age                       50 non-null     int64
 11  Has School Aged Children  50 non-null     object
 12  Has_Pets                  50 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(3), object(7)
memory usage: 5.2+ KB

In [427]:
print(df_merged.isna().sum())
print()
print(df_merged.duplicated().sum())

Purchase ID                 0
Customer ID                 0
Book                        0
Audience                    0
Genre                       0
Price                       0
Book Rating                 0
Purchase Location           0
Purchase Date               0
Customer Name               0
Age                         0
Has School Aged Children    0
Has_Pets                    0
dtype: int64

0

## 2. Prepare Rows for Modeling

Hi again,

We are trying to predict which customers will purchase a book this month.

Can you reformat the data you compiled earlier this week so that it’s ready to be input into a model, with each row representing a customer instead of a purchase?

Thanks!\
Brooke

In [428]:
# What should one row of data look like for the model?
df_april_may = df_merged[df_merged['Purchase Date'].dt.month < 6] 
# Only April (04), May (05) and June (06) in our data, so with month < 6 we get April and May
df_april_may.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02,Mason,16,No,No
3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02,Mason,16,No,No
4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02,Mason,16,No,No

In [429]:
df_june.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date
0,432,117,Blue Waters,Adults,Fiction,23.98,2.6,Online,2023-06-05
1,433,118,The Cave,Adults,Fiction,24.99,4.7,Online,2023-06-07
2,434,106,Best Dinosaur Book Ever,Children,Non-Fiction,10.49,4.7,In Person,2023-06-08
3,435,103,Peter Penn: The Untold Story,Adults,Non-Fiction,27.90,4.8,In Person,2023-06-08
4,436,101,Everything is Amazing,Children,Fiction,4.99,3.9,In Person,2023-06-08

In [430]:
# Create a column called 'June Purchases' that sums up all purchases in June
df_june_purchases= df_june.groupby('Customer ID')['Book'].count().rename('June Purchases').to_frame().reset_index()
print(df_june_purchases.isna().sum())
df_june_purchases.head()

Customer ID       0
June Purchases    0
dtype: int64

   Customer ID  June Purchases
0          101               2
1          103               1
2          106               1
3          108               1
4          111               2

In [431]:
# Create a column called 'Total Spend' that sums up the prices of all the books that were purchased in April and May
df_total_spend= df_april_may.groupby('Customer ID')['Price'].sum().rename('Total Spend').to_frame().reset_index()
print(df_total_spend.isna().sum())
df_total_spend.head()

Customer ID    0
Total Spend    0
dtype: int64

   Customer ID  Total Spend
0          101        33.71
1          102        79.96
2          103        55.20
3          104        42.32
4          105        21.50

In [432]:
# Combine the 'June Purchases' and 'Total Spend' columns into a single DataFrame for modeling
df_model = df_total_spend.merge(df_june_purchases, on='Customer ID', how='left')
df_model.head()

   Customer ID  Total Spend  June Purchases
0          101        33.71             2.0
1          102        79.96             NaN
2          103        55.20             1.0
3          104        42.32             NaN
4          105        21.50             NaN

In [433]:
df_model.fillna(0, inplace=True)

In [434]:
df_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer ID     16 non-null     int64
 1   Total Spend     16 non-null     float64
 2   June Purchases  16 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 512.0 bytes

## 3. Prepare Columns for Modeling

Hi again,

Thanks for your help earlier this week! We just learned that we also have to make all of the data numeric before inputting it into a predictive model.

Can you turn the Audience text field into a numeric field?

Thanks!\
Brooke

In [435]:
df_april_may.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02,Mason,16,No,No
3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02,Mason,16,No,No
4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02,Mason,16,No,No

In [436]:
# Change the Audience field into a dummy variable
df_audience_dummies = pd.get_dummies(df_april_may['Audience'])
df_audience_dummies.head()

   Adults  Children  Teens
0   False      True  False
1   False      True  False
2   False     False   True
3   False     False   True
4   False     False   True

In [437]:
# df_audience_dummies = df_audience_dummies.astype('int')
# df_audience_dummies.head()

In [438]:
# Combine back with the customer table
df_cust_aud= pd.concat([df_april_may['Customer ID'], df_audience_dummies], axis=1)
df_cust_aud.head()

   Customer ID  Adults  Children  Teens
0          101   False      True  False
1          101   False      True  False
2          102   False     False   True
3          102   False     False   True
4          102   False     False   True

In [439]:
# Using the Audience dummy variables, create three new columns that contain
# the number of Adult / Children / Teen books purchased by each customer
df_book_types = df_cust_aud.groupby('Customer ID').sum().reset_index()
df_book_types.head()

   Customer ID  Adults  Children  Teens
0          101       0         5      0
1          102       0         0      4
2          103       2         0      0
3          104       2         0      0
4          105       1         0      0

In [440]:
# Combine the three new columns back with the customer-level data
df_model = df_model.merge(df_book_types, on='Customer ID', how='left')
df_model.head()

   Customer ID  Total Spend  June Purchases  Adults  Children  Teens
0          101        33.71             2.0       0         5      0
1          102        79.96             0.0       0         0      4
2          103        55.20             1.0       2         0      0
3          104        42.32             0.0       2         0      0
4          105        21.50             0.0       1         0      0

In [441]:
df_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer ID     16 non-null     int64
 1   Total Spend     16 non-null     float64
 2   June Purchases  16 non-null     float64
 3   Adults          16 non-null     int64
 4   Children        16 non-null     int64
 5   Teens           16 non-null     int64
dtypes: float64(2), int64(4)
memory usage: 896.0 bytes

## 4. Feature Engineering

Hi again,

I have one final request for you.

As a reminder, our goal is to try and predict which customer will purchase a book this month.

Can you create new features that you think will do a good job making a prediction?

Thanks!\
Brooke

In [442]:
# what features could do a good job predicting june purchases?
df_merged.head()

,Purchase ID,Customer ID,Book,Audience,Genre,Price,Book Rating,Purchase Location,Purchase Date,Customer Name,Age,Has School Aged Children,Has_Pets
0,401,101,Unicorns Are Cool,Children,Fiction,4.99,3.6,Online,2023-04-01,Alexander,36,Yes,No
1,402,101,I Love Unicorns,Children,Fiction,5.99,4.1,Online,2023-04-01,Alexander,36,Yes,No
2,403,102,All About Turtles,Teens,Non-Fiction,19.99,3.3,In Person,2023-04-02,Mason,16,No,No
3,404,102,All About Whales,Teens,Non-Fiction,19.99,2.5,In Person,2023-04-02,Mason,16,No,No
4,405,102,All About Dolphins,Teens,Non-Fiction,19.99,4.2,In Person,2023-04-02,Mason,16,No,No

In [443]:
df_model.head()

   Customer ID  Total Spend  June Purchases  Adults  Children  Teens
0          101        33.71             2.0       0         5      0
1          102        79.96             0.0       0         0      4
2          103        55.20             1.0       2         0      0
3          104        42.32             0.0       2         0      0
4          105        21.50             0.0       1         0      0

In [444]:
df_cust.head()

   Customer ID Customer Name  Age Has School Aged Children Has_Pets
0          101     Alexander   36                      Yes       No
1          102         Mason   16                       No       No
2          103         Ethan   55                       No       No
3          104        Daniel   70                       No       No
4          105       Michael   18                       No      Yes

In [445]:
# create the feature
df_has_children = pd.get_dummies(df_cust[['Customer ID', 'Has School Aged Children']], drop_first=True).rename(columns={'Has School Aged Children_Yes': 'Has Kids'}) # firs tis the No column
df_has_children.head()

   Customer ID  Has Kids
0          101      True
1          102     False
2          103     False
3          104     False
4          105     False

In [446]:
# add it to the dataframe for modeling
df_model = df_model.merge(df_has_children, on='Customer ID', how='left')
df_model.head()

   Customer ID  Total Spend  June Purchases  Adults  Children  Teens  Has Kids
0          101        33.71             2.0       0         5      0      True
1          102        79.96             0.0       0         0      4     False
2          103        55.20             1.0       2         0      0     False
3          104        42.32             0.0       2         0      0     False
4          105        21.50             0.0       1         0      0     False

In [447]:
df_april_may.info()

<class 'pandas.core.frame.DataFrame'>
Index: 31 entries, 0 to 30
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Purchase ID               31 non-null     int64
 1   Customer ID               31 non-null     int64
 2   Book                      31 non-null     object
 3   Audience                  31 non-null     object
 4   Genre                     31 non-null     object
 5   Price                     31 non-null     float64
 6   Book Rating               31 non-null     float64
 7   Purchase Location         31 non-null     object
 8   Purchase Date             31 non-null     datetime64[ns]
 9   Customer Name             31 non-null     object
 10  Age                       31 non-null     int64
 11  Has School Aged Children  31 non-null     object
 12  Has_Pets                  31 non-null     object
dtypes: datetime64[ns](1), float64(2), int64(3), object(7)
memory usage: 3.4+ KB

In [448]:
df_loc = pd.get_dummies(df_april_may['Purchase Location'])
df_loc.head()

   In Person  Online
0      False    True
1      False    True
2       True   False
3       True   False
4       True   False

In [449]:
df_april_may_loc = pd.concat([df_april_may['Customer ID'], df_loc], axis=1)
df_april_may_loc.head()

   Customer ID  In Person  Online
0          101      False    True
1          101      False    True
2          102       True   False
3          102       True   False
4          102       True   False

In [450]:
grouped_loc = df_april_may_loc.groupby('Customer ID').sum().reset_index()
grouped_loc.head()

   Customer ID  In Person  Online
0          101          0       5
1          102          3       1
2          103          2       0
3          104          1       1
4          105          0       1

In [451]:
# create another feature
in_person_pct = (grouped_loc['In Person'] / (grouped_loc['In Person'] + grouped_loc['Online'])*100).rename('Percent In Person')
in_person_pct.head()

0      0.0
1     75.0
2    100.0
3     50.0
4      0.0
Name: Percent In Person, dtype: float64

In [452]:
# add it to the dataframe for modeling
df_model = pd.concat([df_model, in_person_pct], axis=1)
df_model.head()

In [456]:
# view the final dataframe that is ready to be input into a model
final_df = df_model[['June Purchases', 'Total Spend', 'Adults', 
                     'Children', 'Teens', 'Has Kids', 'Percent In Person']]
final_df.head()

,June Purchases,Total Spend,Adults,Children,Teens,Has Kids,Percent In Person
0,2.0,33.71,0,5,0,True,0.0
1,0.0,79.96,0,0,4,False,75.0
2,1.0,55.20,2,0,0,False,100.0
3,0.0,42.32,2,0,0,False,50.0
4,0.0,21.50,1,0,0,False,0.0

In [457]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   June Purchases     16 non-null     float64
 1   Total Spend        16 non-null     float64
 2   Adults             16 non-null     int64
 3   Children           16 non-null     int64
 4   Teens              16 non-null     int64
 5   Has Kids           16 non-null     bool
 6   Percent In Person  16 non-null     float64
dtypes: bool(1), float64(3), int64(3)
memory usage: 912.0 bytes